app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."user_id" = $1  [["user_id", 2]]
---
  def index
    @inventories = current_user.inventories.all

INSERT INTO "inventories" ("brand", "model", "imgurl", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["brand", "adidas,"], ["model", "yeezy Boost 350 V2 Beluga,"], ["imgurl", "null"], ["user_id", 1], ["created_at", "2018-07-20 19:33:35.741434"], ["updated_at", "2018-07-20 19:33:35.741434"]]
---
  def create
    @inventory = current_user.inventories.new(inventory_params)
    if @inventory.save

UPDATE "inventories" SET "brand" = $1, "model" = $2, "imgurl" = $3, "updated_at" = $4 WHERE "inventories"."id" = $5  [["brand", "new balance"], ["model", "597"], ["imgurl", "1"], ["updated_at", "2018-07-25 22:57:38.856530"], ["id", 2]]
---
  def update
    if @inventory.update(inventory_params)

DELETE FROM "inventories" WHERE "inventories"."id" = $1  [["id", 1]]
---
  def destroy
    @inventory.destroy

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_inventory
      @inventory = current_user.inventories.find(params[:id])